doom/.config/doom/config.org
* Python

#+begin_src emacs-lisp
(after! lsp-mode
  (setq lsp-pyright-python-executable-cmd "python") ;; or path to your venv's python
  (setq lsp-pyright-typechecking-mode "basic"))      ;; optional, for type checking level
#+end_src
