doom/.config/doom/config.el
  (setq lsp-pyright-python-executable-cmd "python") ;; or path to your venv's python
  (setq lsp-pyright-typechecking-mode "basic"))      ;; optional, for type checking level
